NACA0012/nacaAirfoil_n0012familyI.4.hex_gmesh/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1000;

boundaryField
{


    QUAD_bdy____1
    {
        type            empty;
    }

    QUAD_bdy____2
    {
        type            empty;
    }

    QUAD_bdy____3
    {
        type            inletOutlet;
        inletValue      uniform 1000;
        value           uniform 1000;
    }

    QUAD_bdy____4
    {
        type            inletOutlet;
        inletValue      uniform 1000;
        value           uniform 1000;
    }

    QUAD_bdy____5
    {
        type            kqRWallFunction;
        value           uniform 1000;
    }

    QUAD_bdy____6
    {
        type            inletOutlet;
        inletValue      uniform 1000;
        value           uniform 1000;
    }
}


// ************************************************************************* //
