NACA0012/nacaAirfoil_n0012familyI.4.hex_gmesh/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    QUAD_bdy____1
    {
        type            empty;
    }

    QUAD_bdy____2
    {
        type            empty;
    }

    QUAD_bdy____3
    {
        type            calculated;
        value           uniform 0;
    }

    QUAD_bdy____4
    {
        type            calculated;
        value           uniform 0;
    }

    QUAD_bdy____5
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0;
    }

    QUAD_bdy____6
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
